Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91144.svd
               <register>
                  <name>CHDSTRD</name>
                  <description>CHANNEL DESTINATION CELL STRIDE SIZE REGISTER</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DSTRD</name>
                        <description>Destination Cell Stride Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHXSIZ</name>
                  <description>CHANNEL TRANSFER SIZE REGISTER</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CSZ</name>
                        <description>Cell transfer size in bytes.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>BLKSZ</name>
                        <description>Block transfer size in bytes.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHPDAT</name>
                  <description>CHANNEL PATTERN MATCH DATA</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PDAT</name>
                        <description>Channel Pattern Match Data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PIGN</name>
                        <description>Channel Pattern Ignore Value</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHCTRLCRC</name>
                  <description>CHANNEL CONTROL CRC</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CRCMD</name>
                        <description>CRC/Checksum Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CRCMDSelect</name>
                           <enumeratedValue>
                              <name>CRC_16</name>
                              <description>Normal (0x8005) CRC-16/CRC-16-IBM/CRC-16-ANSI</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CRC_16_CCITT</name>
                              <description>Normal (0x1021) CRC-16-CCITT</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16_BIT_CRCPOLYA</name>
                              <description>CRC-16 based on polynomial provided in CRCPOLYA (POLYA[15:0]) register</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16_BIT_CRCPOLYB</name>
                              <description>CRC-16 based on polynomial provided in CRCPOLYB (POLYB[15:0]) register</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CRC_32</name>
                              <description>Normal (0x04C11DB7) CRC-32</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>32_BIT_CRCPOLYA</name>
                              <description>CRC-32 based on polynomial provided in CRCPOLYA register</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>32_BIT_CRCPOLYB</name>
                              <description>CRC-32 based on polynomial provided in CRCPOLYB register</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IP_HDR_CHECKSUM</name>
                              <description>Calculate IP header checksum</description>
                              <value>7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CRCAPP</name>
                        <description>CRC Append Mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCXOR</name>
                        <description>CRC XOR Mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCROUT</name>
                        <description>CRC Reflected Output Mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCRIN</name>
                        <description>CRC Reflect Input Selection</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHCRCDAT</name>
                  <description>CHANNEL CRC/CHECKSUM DATA REGISTER</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CRCDAT</name>
                        <description>CRC Data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHNXT</name>
                  <description>CHANNEL NEXT DESCRIPTOR ADDRESS POINTER</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NXT</name>
                        <description>Channel Address Pointer to Next Descriptor</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHLLCFGSTAT</name>
                  <description>CHANNEL LINKED LIST CONFIGURATION STATUS REGISTER</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Register Descriptor Load</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVCTRL</name>
                        <description>EVCTRL Register Descriptor Load</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSA</name>
                        <description>Source Start Address Descriptor Load</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DSA</name>
                        <description>Destination Start Address Descriptor Load</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSTRD</name>
                        <description>Source Cell Stride Size Descriptor Load</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DSTRD</name>
                        <description>Destination Cell Stride Size Descriptor Load</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>XSIZ</name>
                        <description>Transfer Size Descriptor Load</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PDAT</name>
                        <description>Match Pattern Descriptor Load</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLCRC</name>
                        <description>Control CRC Descriptor Load</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCDAT</name>
                        <description>CRC Data Descriptor Load</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTATBC</name>
                  <description>CHANNEL STATUS BLOCK COUNT REGISTER</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BBTC</name>
                        <description>Bytes Transfered in the Block Counter</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>17</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTATCC</name>
                  <description>CHANNEL STATUS CELL COUNT REGISTER</description>
                  <addressOffset>0x44</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CBTC</name>
                        <description>Bytes Transfered in the Cell Counter</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTAT</name>
                  <description>CHANNEL STATUS REGISTER</description>
                  <addressOffset>0x48</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BLKBUSY</name>
                        <description>Channel Block Transfer Busy Status Bit (0: none; 1: busy)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CELLBUSY</name>
                        <description>Channel Cell Transfer Busy Status Bit (0: none; 1: busy)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DREAD</name>
                        <description>Descriptor Read Status Bit (0: not read or not avail, 1: read and loaded)</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
