Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ2051CA91144.svd
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF[%s]</name>
               <description>Compare and Capture Buffer</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH4_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH5_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH6_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>26</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x45012000</baseAddress>
         <interrupt>
            <name>TCC1_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>135</value>
         </interrupt>
         <interrupt>
            <name>TCC1_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>136</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>137</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>138</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>139</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>140</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC4</name>
            <description>TCC Match/Compare 4</description>
            <value>141</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC5</name>
            <description>TCC Match/Compare 5</description>
            <value>142</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC6</name>
            <description>TCC Match/Compare 6</description>
            <value>143</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC7</name>
            <description>TCC Match/Compare 7</description>
            <value>144</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x45014000</baseAddress>
         <interrupt>
            <name>TCC2_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>145</value>
         </interrupt>
         <interrupt>
            <name>TCC2_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>146</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>147</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>148</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>149</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>150</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC4</name>
            <description>TCC Match/Compare 4</description>
            <value>151</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC5</name>
            <description>TCC Match/Compare 5</description>
            <value>152</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC3</name>
         <baseAddress>0x45810000</baseAddress>
         <interrupt>
            <name>TCC3_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>153</value>
         </interrupt>
         <interrupt>
            <name>TCC3_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>154</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>155</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>156</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC4</name>
         <baseAddress>0x45812000</baseAddress>
         <interrupt>
            <name>TCC4_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>157</value>
         </interrupt>
         <interrupt>
            <name>TCC4_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>158</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>159</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>160</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC5</name>
         <baseAddress>0x46010000</baseAddress>
         <interrupt>
            <name>TCC5_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>161</value>
         </interrupt>
         <interrupt>
            <name>TCC5_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>162</value>
         </interrupt>
         <interrupt>
            <name>TCC5_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>163</value>
         </interrupt>
         <interrupt>
            <name>TCC5_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>164</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC6</name>
         <baseAddress>0x46012000</baseAddress>
         <interrupt>
            <name>TCC6_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>165</value>
         </interrupt>
         <interrupt>
            <name>TCC6_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>166</value>
         </interrupt>
         <interrupt>
            <name>TCC6_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>167</value>
         </interrupt>
         <interrupt>
            <name>TCC6_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>168</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC7</name>
         <baseAddress>0x46810000</baseAddress>
         <interrupt>
            <name>TCC7_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>169</value>
         </interrupt>
         <interrupt>
            <name>TCC7_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>170</value>
         </interrupt>
         <interrupt>
            <name>TCC7_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>171</value>
         </interrupt>
         <interrupt>
            <name>TCC7_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>172</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC8</name>
         <baseAddress>0x46812000</baseAddress>
         <interrupt>
            <name>TCC8_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>173</value>
         </interrupt>
         <interrupt>
            <name>TCC8_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>174</value>
         </interrupt>
         <interrupt>
            <name>TCC8_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>175</value>
         </interrupt>
         <interrupt>
            <name>TCC8_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>176</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC9</name>
         <baseAddress>0x46814000</baseAddress>
         <interrupt>
            <name>TCC9_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>177</value>
         </interrupt>
         <interrupt>
            <name>TCC9_CNT_TRIG</name>
            <description>Counter/Re-Trigger Interrupt</description>
            <value>178</value>
         </interrupt>
         <interrupt>
            <name>TCC9_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>179</value>
         </interrupt>
         <interrupt>
            <name>TCC9_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>180</value>
         </interrupt>
         <interrupt>
            <name>TCC9_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>181</value>
         </interrupt>
         <interrupt>
            <name>TCC9_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>182</value>
         </interrupt>
         <interrupt>
            <name>TCC9_MC4</name>
            <description>TCC Match/Compare 4</description>
            <value>183</value>
         </interrupt>
         <interrupt>
            <name>TCC9_MC5</name>
            <description>TCC Match/Compare 5</description>
            <value>184</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TPI</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Trace Port Interface Register</description>
         <baseAddress>0xE0040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xFD0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SSPSR</name>
               <description>Supported Parallel Port Size Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>CSPSR</name>
               <description>Current Parallel Port Size Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>ACPR</name>
               <description>Asynchronous Clock Prescaler Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRESCALER</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPPR</name>
               <description>Selected Pin Protocol Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXMODE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFSR</name>
               <description>Formatter and Flush Status Register</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FlInProg</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FtStopped</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCPresent</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FtNonStop</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFCR</name>
               <description>Formatter and Flush Control Register</description>
               <addressOffset>0x304</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EnFCont</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TrigIn</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSCR</name>
               <description>Formatter Synchronization Counter Register</description>
               <addressOffset>0x308</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>TRIGGER</name>
               <description>TRIGGER</description>
               <addressOffset>0xEE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TRIGGER</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFO0</name>
               <description>Integration ETM Data</description>
               <addressOffset>0xEEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ETM0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM1</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM2</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM_bytecount</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ETM_ATVALID</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITM_bytecount</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ITM_ATVALID</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ITATBCTR2</name>
               <description>ITATBCTR2</description>
               <addressOffset>0xEF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ATREADY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ITATBCTR0</name>
               <description>ITATBCTR0</description>
               <addressOffset>0xEF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ATREADY</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFO1</name>
               <description>Integration ITM Data</description>
               <addressOffset>0xEFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ITM0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ITM1</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ITM2</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ETM_bytecount</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ETM_ATVALID</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITM_bytecount</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ITM_ATVALID</name>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ITCTRL</name>
               <description>Integration Mode Control</description>
               <addressOffset>0xF00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>Mode</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLAIMSET</name>
               <description>Claim tag set</description>
               <addressOffset>0xFA0</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CLAIMCLR</name>
               <description>Claim tag clear</description>
               <addressOffset>0xFA4</addressOffset>
               <size>32</size>
            </register>
